tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "gettext"
brew "asdf"
brew "openssl@3"
brew "bash"
brew "chezmoi"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "fd"
brew "fish"
brew "freetds"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "pinentry"
brew "gnupg"
brew "graphviz"
brew "icu4c@75"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "ninja"
brew "ocaml"
brew "opam"
brew "openjdk"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "pyenv"
brew "python-tk@3.11"
brew "python-tk@3.9"
brew "qalculate-gtk"
brew "ripgrep"
brew "rsync"
brew "tcl-tk"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "wimlib"
brew "yazi"
brew "zoxide"
cask "alt-tab"
cask "anki"
cask "appcleaner"
cask "bruno"
cask "calibre"
cask "font-jetbrains-mono"
cask "monarch"
cask "notunes"
cask "pika"
cask "wezterm"
cask "xquartz"
vscode "aeschli.vscode-css-formatter"
vscode "afmicc.getterandsettergenerator"
vscode "amodio.tsl-problem-matcher"
vscode "basdp.language-gas-x86"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dprint.dprint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gkotas.restore-git-branch-tabs"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "kleber-swf.unity-code-snippets"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nrwl.angular-console"
vscode "ocamllabs.ocaml-platform"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "scrimba.vsimba"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tobiah.unity-tools"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xyc.vscode-mdx-preview"
vscode "yclepticstudios.unity-snippets"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
