tap "blueputty01/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "gettext"
brew "git"
brew "asdf"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "chezmoi"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "duti"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "freetds"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "pinentry"
brew "gnupg"
brew "graphviz"
brew "icu4c@75"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "neovim"
brew "ninja"
brew "ocaml"
brew "rsync"
brew "opam"
brew "openjdk"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "qalculate-gtk"
brew "ripgrep"
brew "tcl-tk"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "wimlib"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
cask "anki"
cask "appcleaner"
cask "battery"
cask "bruno"
cask "calibre"
cask "font-jetbrains-mono"
cask "notunes"
cask "pika"
cask "roblox"
cask "wezterm"
cask "xquartz"
cask "zotero"
vscode "amodio.tsl-problem-matcher"
vscode "asvetliakov.vscode-neovim"
vscode "basdp.language-gas-x86"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ocamllabs.ocaml-platform"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "xyc.vscode-mdx-preview"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "zellij"
